_org/2023-12-1-december-papers.org
#+OPTIONS: ^:nil
#+BEGIN_EXPORT html
---
layout: default
title: Paper Digest of December 2023
tags: [Reinforcement Learning, QD-Tree]
nav_order: {{ page.date }}
---
#+END_EXPORT

|-------------------------------------------------------------------------------------------------+-----------------------------------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+-------------------------------------------+-----------------------------------------------------|
| Title                                                                                           | Authors                                                         | Synthesis                                                                                                                                                                                                         | Publisher                                 | Keywords                                            |
|-------------------------------------------------------------------------------------------------+-----------------------------------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+-------------------------------------------+-----------------------------------------------------|
| Neural Packet Classification                                                                    | Eric Liang, Ion Stoica                                          | This paper proposes using RL to construct a decision tree for packet classifiers, and it shows how to model formulate the MDP for constructing the decision tree.                                                 | SIGCOMM 2019                              | Reinforcement Learning, Decision Tree               |
| Detect, Distill and Update: Learned DB Systems Facing Out of Distribution Data                  | Meghdad Kurmanji, Peter Triantafillou                           | This paper presents a learning framework called DDUp for detecting OODs and updating learned database components. A statistical test is used to test the hypothesis that the new data obey the same distribution as the learned model. Knowledge Distillation is used to transfer knowledge from the old model to the new model if the hypothesis is rejected. | SIGMOD 2023                               | Knowledge Distillation, Transfer Learning           |
| From Large Language Models to Databases and Back - A discussion on research and education       | Sihem Amer-Yahia, .etc                                          | A panel discussion on LLM and database research. They discussed about the potential impact of LLM towards databases, and what are advantages and limitations of incoperating LLM in databases.                    | DASFAA 2023                               | LLM, Database, ChatGPT                              |
| *Fine-grained Partitioning for Aggressive Data Skipping*                                        | Liwen Sun, Michael J. Franklin, Sanjay Krishnan, Reynold S. Xin | This paper presents a feature based partitioning framework. A number of features are selected to calculate a feature vector for each tuple. The conjunction of all feature vectors in a block is used for data skipping. And data are partitioned to maximize the data skipping gain. The contributions are (1) a workload analyzer, which generates a set of features from a query log, (2) a partitioner, which computes a blocking scheme by solving a optimization problem, (3) a feature-based block skipping framework used in query execution. | SIGMOD 2014                               | Partitioning, NP-Hard                               |
| Small Materialized Aggregates: A Light Weight Index Structure for Data Warehousing              | Guido Moerkotte                                                 | This paper shows how to speed up data warehouses with summaries called Small Materialized Aggregates. These SMAs are lightweight and easy to generate. They are similiar to views or data cubes but only compact information is generated for each data bucket. | VLDB 1998                                 | SMA, Data Cube, Data Warehouse                      |
| Different Cube Computation Approaches: Survey Paper                                             | Dhanshri S. Lad, Rasika P. Saste                                | This paper survey the different algorithms to compute data cubes. The authors also propose use MR to speed up the data cube computation.                                                                          | IJCSIT 2014                               | Data Cube, Mapreduce                                |
| High-Diemnsional OLAP: A Minimal Cubing Approach                                                | Xiaolei Li, Jiawei Han, Hector Gonzalez                         | This paper proposes to decompose the data cube computation by precomputing small sized groups called fragements and a value-list inverted index. All dimensions are divided into 3/4 dimension groups called fragments. For each fragments all data cubes are computed as lists of tuple ids using the inverted index. This paper also shows how to serve point queries and subcube queries with these fragments. | VLDB 2004                                 | Data Cube, Shell Fragment, OLAP                     |
| Data Cube: A Relational Aggregation Operator - Generalizing Group-By, Cross-Tab, and Sub-Totals | Jim Gray, Adam Bosworth, Andrew Layman, Hamid Pirahesh          | This visionary paper explains to us what are data cubes and why we need them in analytics. It also shows us how to generate data cubes with the SQL group-by, proposes what enhancements we need make to group-bys. And it categorifies the aggregate functions. It shows how to compute data cubes with distributive and algebraic aggregates. | Data Mining and Knowledge Discovery 19997 | Data Cube, Group-By, Cross-Tab, Roll-Up, Drill-Down |
|-------------------------------------------------------------------------------------------------+-----------------------------------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+-------------------------------------------+-----------------------------------------------------|

